In [128]:
import numpy as np
import pandas as pd

In [129]:
data_dic={
    'A':[1,2,np.nan,4,np.nan],
    'B':[np.nan,np.nan,np.nan,np.nan,np.nan],
    'C':[11,12,13,14,15],
    'D':[16,np.nan,18,19,20]
}
df=pd.DataFrame(data_dic)

In [130]:
df

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [131]:
df.isnull()

       A     B      C      D
0  False  True  False  False
1  False  True  False   True
2   True  True  False  False
3  False  True  False  False
4   True  True  False  False

In [132]:
df.notnull()

       A      B     C      D
0   True  False  True   True
1   True  False  True  False
2  False  False  True   True
3   True  False  True   True
4  False  False  True   True

In [133]:
df['A'].sum()

7.0

In [134]:
df['D'].sum()
#no two index names can be same (i.e columns headdings)

73.0

In [135]:
df.dropna()

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [136]:
df.dropna(axis=1) #here inplace value is true(in other word child lock)

    C
0  11
1  12
2  13
3  14
4  15

In [137]:
df.dropna(thresh=4,axis=1)
#this will drop any columns that have atleast 4 nans values

    C     D
0  11  16.0
1  12   NaN
2  13  18.0
3  14  19.0
4  15  20.0

In [138]:
df.fillna(value='Filled')
#here child lock is on

        A       B   C       D
0     1.0  Filled  11    16.0
1     2.0  Filled  12  Filled
2  Filled  Filled  13    18.0
3     4.0  Filled  14    19.0
4  Filled  Filled  15    20.0

In [139]:
df['A'].fillna(value=df['A'].mean())
#nan values will be filled with mean of the column

0    1.000000
1    2.000000
2    2.333333
3    4.000000
4    2.333333
Name: A, dtype: float64

In [140]:
df.fillna(method='ffill')
#forward fill here the vlaue before nan is filled in the place of nan

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12  16.0
2  2.0 NaN  13  18.0
3  4.0 NaN  14  19.0
4  4.0 NaN  15  20.0

In [141]:
df.fillna(method='bfill')
#backward fill here the value after nan is filled in the place of nan

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12  18.0
2  4.0 NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [142]:
df.fillna(0)

     A    B   C     D
0  1.0  0.0  11  16.0
1  2.0  0.0  12   0.0
2  0.0  0.0  13  18.0
3  4.0  0.0  14  19.0
4  0.0  0.0  15  20.0

In [143]:
#change the column head name

df.rename(columns={'D':'E'},inplace=True)
df

     A   B   C     E
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [ ]:
#changing it back
df.rename(columns={''D})